Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: བློ་དང་ལྡན་པ་མཐར་གྱིས་ནི། །མྱུར་དུ་བྱང་ཆུབ་གཞོལ་བར་འགྱུར། །
en: In due course he will obtain intelligence And swiftly travel the path to awakening.

source: དེ་བཞིན་གཤེགས་པའི་བསྟན་འདི་ལ། །རྣམ་པ་སྣ་ཚོགས་བྱ་བ་བྱེད། །
en: He will do various works Related to the Tathāgata’s teachings. {53.500}

source: བྱང་གི་ཕྱོགས་ལ་བརྟེན་ནས་ནི། །དེ་ཡི་ཚེ་ན་འབྱུང་བར་འགྱུར། །ལྷ་ལྡན་ཡུལ་ཞེས་བྱ་བ་ཡི། །གངས་ཅན་རི་ཡི་ནང་གནས་པའི། །རྒྱལ་པོ་མི་ཡི་ལྷ་ཞེས་པ། །ལིཙྪ་བཱི་རྣམས་རིགས་སུ་བྱུང་། །
en: “At that time, In the north, In the country called Nepāla Nestled at the foothills of the snowy mountains, There will be King Mānavadeva, Born to the Licchavi clan. {53.501}

source: དེ་ཡང་སྔགས་ཀྱི་དོན་བསྒྲུབས་ཏེ། །ལོངས་སྤྱོད་ཆེ་དང་ལྡན་པར་འགྱུར། །
en: “He too, having accomplished his mantric quest, Will come to enjoy great comforts.

source: རིག་པ་ལོངས་སྤྱོད་ལྡན་ཞེས་བྱ། །མི་ཡི་བདག་པོས་དེ་ཡང་གྲུབ། །
en: This king will accomplish The vidyā called Bhogavatī.

source: ལོ་ནི་བརྒྱད་ཅུར་རྒྱལ་སྲིད་བྱས། །དེས་ནི་རྐུན་མ་རྣམ་པར་སྤངས། །
en: During his reign of eighty years, The kingdom will be free from thieves. {53.502}

source: རྒྱལ་པོ་དེ་ནི་སྲོག་སྤངས་ནས། །དེར་ཡང་སྔགས་ནི་མྱུར་འགྲུབ་སྟེ། །ཞི་དང་རྒྱས་པ་བསིལ་བྱེད་པའོ། །
en: “When his life ends, The king will go to heaven. The mantras especially effective at that time Will be the peaceful mantras for pacifying and nourishing. {53.503}

source: འཇིག་རྟེན་སྒྲོལ་མ་ཞེས་གྲགས་དང་། །ལྷ་མོ་གོས་དཀར་མ་དང་ནི། །དཀར་མོ་ཆེན་མོ་གཞན་ཕན་བརྩོན། །རྟག་ཏུ་ཡིད་ནི་མི་སྐྱོ་བའོ། །
en: “The world-renowned Tārā, The goddess Pāṇḍaravāsinī, And Mahāśvetā will strive to benefit others, Never growing weary in their minds. {53.504}

source: དེ་ལ་སོགས་པ་གསུངས་པ་ཡི། །དེ་བཞིན་རྒྱལ་པོ་མང་པོ་ནི། །
en: “These and many other kings Will come at that time, it is said.

source: རྣམ་པ་དུ་མ་མང་པོ་དག །ཁ་དོག་སྣ་ཚོགས་སྣ་ཚོགས་གཟུགས། །
en: They will be many, of many types, Described according to their varying natures. {53.505}

source: ཁ་བ་ཅན་གནས་ཀླ་ཀློའི་རྒྱལ། །དེ་ཡང་སྟོན་པ་མཆོད་བྱེད་པའོ། །
en: “The kings of the mlecchas in the snowy land Will also worship the Teacher.

source: ཁྱུ་མཆོག་ཁྱུ་མཆོག་བཟང་པོ་དང་། །ས་འོད་དེ་བཞིན་ས་འོད་བཟང་། །དེ་བཞིན་ཕ་རོལ་གནོན་ཉིད་དང་། །རྐང་པའི་འགྲོས་ཞེས་བསྟན་པ་ཡིན། །
en: They are Vṛṣa, Suvṛṣa, Bhūbhāsa, Subhūbhāsa, Bhākrama, Padakrama, And the one known as Kamala. {53.506}

source: ས་སྲུང་དང་ནི་བེའུ་དང་། །འོད་ལྡན་ཉིད་ནི་ཕྱི་མ་ཡིན། །ཐ་མར་ཆར་རྒྱལ་ངང་ཚུལ་ཏེ། །
en: “There will also be the western kings: Bhāgupta, Vatsaka, Bhāsvat, Udaya, and Jiṣṇu being the last.

source: ཀླ་ཀློ་རྣམ་པ་སྣ་ཚོགས་ཡིན། །
en: These too are the various kings of the mlecchas.

source: དེ་འོག་ལུགས་ནི་རྣམ་ཞིག་ཅིང་། །ཕྱི་རོལ་སྐྱེ་དགུས་ཉེ་བར་སྤྱོད། །
en: After that, the kings will defy propriety By serving the interests of foreigners. {53.507}

source: དེ་ཚེ་བལ་ཡུལ་བདག་པོ་ནི། །མཚོན་གྱིས་འཐབ་པས་རྣམ་པར་འཇིག །
en: “At that time, the king of Nepāla Will perish from armed onslaughts.

source: ཀླ་ཀློའི་རྐུན་པོ་བསྟེན་པ་ཡི། །དེར་ནི་རྒྱལ་པོ་རྣམ་པར་འཇིག །ས་བདག་དུ་མ་གསུངས་པ་རྣམས། །སྣ་ཚོགས་ལྷ་དང་བྲམ་ཟེ་དག །དེ་ཡི་ཚེ་ན་འབྱུང་བར་འགྱུར། །
en: The vidyā s will be lost, and so will be the kings Who served the mleccha rogues. {53.508} “Many different kings have been foretold, Including some partial to the brahmins, Whose rule will extend All around Tibet. {53.509}

source: རྒྱ་ཡུལ་ཀུན་ལ་བརྟེན་པ་ཡི། །རྒྱལ་པོ་དབྱིག་གི་སྙིང་ཞེས་བྱ། །
en: “The king Hiraṇyagarbha will have A great and very powerful army.

source: སྡེ་ཆེན་སྟོབས་ཀྱང་ཆེ་བ་དང་། །བློན་པོ་རྒྱ་ཆེ་ཉིད་དང་ནི། །སྐྱེ་བོ་རྩ་ལག་རབ་ཏུ་མང་། །
en: He will be a friend to many people, And his government will extend far and wide. {53.510}

source: ཀླ་ཀློས་བཏུད་དང་རྣམ་པར་རྒྱལ། །སྟོན་པའི་བསྟན་པ་དེ་གཙོར་བྱེད། །
en: “He will be honored by the mlecchas as a conqueror And devoted to the teachings of the Teacher.

source: གཞོན་ནུ་བདག་ཉིད་ཆེན་པོ་ཉིད། །དེ་ཡི་སྔགས་ནི་རབ་བསྒྲུབས་པ། །
en: He will accomplish the mantra Of the divine youth of great splendor {53.511}

source: མཐུ་ནི་ཆེན་པོ་དང་ལྡན་པའི། །རིག་པའི་རྒྱལ་པོ་ཡི་གེ་བརྒྱད། །དཔའ་བོ་ཆེ་ཞེས་རྣམ་པར་གྲགས། །ཕུན་སུམ་ཚོགས་པའི་གནས་ཆེན་ཡིན། །
en: “And will derive from it great power. He will employ the eight-syllable vidyārāja Known as ‘Great Hero,’ Which confers great fortune and authority. {53.512}

source: དེ་ཡི་བྱིས་པའི་བློ་ཡིས་ནི། །རྒྱལ་སྲིད་ཕྱིར་ནི་རབ་སྨོན་བྱས། །གང་གིས་དྲན་པ་ཙམ་གྱིས་ནི། །སངས་རྒྱས་ཉིད་དུ་ངེས་འགྱུར་བ། །
en: “With this mantra, which is certain to confer Buddhahood merely by recollecting it, The king will naively focus On the affairs of his realm, {53.513}

source: མི་བདག་རྒྱལ་ཐབས་ཉིད་ཀྱི་ཕྱིར། །དེ་ནི་སྐལ་བ་མི་ཉུང་འགྱུར། །མཆོག་གི་སྦྱིན་པ་བླ་ན་མེད། །
en: “Occupying himself with small matters For the sake of his kingdom While wishing to obtain Supreme boons. {53.514}

source: བསམ་པ་ཙམ་གྱིས་ཐོབ་པ་ཉིད། །ཚངས་སོགས་ལྷ་རྣམས་ཐམས་ཅད་ལ། །མ་ལུས་ལུང་ནི་རྩོལ་བྱེད་ན། །ལྷ་ངན་ཕལ་པ་དག་དང་ནི། །མི་ཡི་འཇིག་རྟེན་སྨོས་ཅི་དགོས། །
en: “He will command, at all times, All the deities such as Brahmā and so forth, Let alone the people in the world Or other beings in reviled states of existence. {53.515}

source: ལོ་ནི་བརྒྱ་དང་ལྔ་བཅུར་འཚོ། །གྲགས་ཆེན་ལྷ་ཡི་གནས་སུ་འགྲོ། །
en: “This great king will live one hundred and fifty years, And then go to heaven.

source: ཆོས་ཀྱི་བདག་ཉིད་དེ་མཐར་གྱིས། །བྱང་ཆུབ་དམ་པ་ཐོབ་པར་འགྱུར། །
en: In due course he will fully assimilate the Dharma And attain supreme awakening. {53.516}

source: གཞོན་ནུས་ཡོངས་སུ་བཤད་པ་ཡི། །རིག་པ་འདི་ནི་དེ་ཡུལ་དུ། །
en: “The vidyā s taught by the divine youth Will be efficacious in that country.

source: དེ་ནི་མྱུར་དུ་འགྲུབ་འགྱུར་གྱིས། །རིག་པ་གཞན་ནི་ནམ་ཡང་མིན། །
en: These vidyā s and none other Will swiftly lead to success. {53.517}

source: བྱང་ཆུབ་སེམས་དཔའ་དཔའ་བོ་ཆེ། །འཇམ་པའི་དབྱངས་ནི་འོད་ཆེན་པོ། །མངོན་སུམ་དེ་ཡི་ཡུལ་དག་ན། །བྱིས་པའི་གཟུགས་ཀྱིས་བཞུགས་པ་ཡིན། །
en: “The valiant bodhisattva Mañjughoṣa of great splendor Will be manifestly present In that country in his youthful form.

source: གྲུབ་པའི་ཞིང་མཆོག་དམ་པ་ལ། །མི་ནི་ཡོངས་སུ་སྒྲུབ་པར་འགྱུར། །
en: It is the place of supreme accomplishment, And people there will accomplish the state of divinity. {53.518}

source: རྒྱལ་པོ་ཏུ་རུཥྐ་ཞེས་བྱ། །བྱང་ཕྱོགས་ལ་ནི་ཡང་དག་བརྟེན། །
en: “A king by the name Turuṣka Will rise in the country up north.

source: སྡེ་ཆེན་བརྩོན་འགྲུས་ཆེ་བ་སྟེ། །དེ་ཡི་གནས་སུ་འབྱུང་བར་འགྱུར། །ཤིང་ཤུན་གྱོན་ཡུལ་མ་གཏོགས་པ། །ཁ་ཆེའི་མཐར་ཐུག་ཀ་ཤིར་བཅས། །
en: Valiant and commanding a great army, He will rule the area extending Up to the gateway of Kaśmīra And including Baṣkala, Udyāna, and Kāviśa. {53.519}

source: དེ་ནི་དཔག་ཚད་བདུན་བརྒྱ་དང་། །འབུམ་ཕྲག་གཉིས་ཀྱི་ས་བདག་ཏུ། །
en: “This king will rule an area Extending over one hundred and seven leagues [With a population of] Two hundred and seventy-seven thousand.

source: དེ་ཚེ་དུས་ཀྱི་ཐ་མ་ལ། །དེ་ཚེ་ཐེ་ཚོམ་མེད་པར་འགྱུར། །
en: This will happen, there is no doubt, During the debased eon. {53.520}

source: དེ་ཡང་སྔགས་ནི་གྲུབ་པས་ན། །ལོ་ནི་སུམ་བརྒྱ་དག་ཏུ་འཚོ། །
en: “Turuṣka will master the mantras And will live three hundred years.

source: བློ་ལྡན་མི་ཡི་སྤྱན་གྱུར་པས། །སྐྲ་ཅན་མ་ཡི་རིག་པ་བསྒྲུབས། །
en: This wise king who watches over the people Will accomplish the vidyā Keśinī. {53.521}

source: བདག་ཉིད་དགེ་བར་བྱ་བའི་ཕྱིར། །ལྷ་ཁང་དག་ནི་མང་པོ་བྱས། །སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་གཅིག་གི། །མཆོད་རྟེན་མཆོག་ནི་དེ་བཞིན་བྱས། །
en: “Adding to his glory, He will establish monasteries And build eighty-six thousand Great stūpas. {53.522}

source: ཐེག་པ་ཆེན་པོ་མཆོག་ཆོས་དང་། །དེ་བཞིན་སངས་རྒྱས་རྣམས་ཀྱི་ཡུམ། །འཇིག་རྟེན་ཤེས་རབ་ཕ་རོལ་ཕྱིན། །དེ་ཡི་ཡུལ་དུ་རབ་གནས་བྱས། །
en: “The excellent Mahāyāna Dharma Will be established in that country, Including the mother of the buddhas— The Prajñāpāramitā. {53.523}

source: རྒྱལ་པོ་དེ་ནི་ལུས་ཞིག་ནས། །མཐོ་རིས་འཇིག་རྟེན་འགྲོ་བར་འགྱུར། །ས་བདག་དེ་ནི་མཐར་གྱིས་སུ། །རྫོགས་པའི་བྱང་ཆུབ་བླ་མེད་འཐོབ། །
en: “When King Turuṣka leaves his body, He will go to the celestial realm, And in due course he will attain Supreme awakening. {53.524}

source: དེ་འོག་ས་བདག་རྒྱལ་པོ་ནི། །ཆེན་པོ་ཏུ་རུཥྐ་ཞེས་བྱ། །
en: “After him, there will be another king By the name of Mahāturuṣka.

source: བློ་ལྡན་མང་པོས་བཀུར་ཞེས་བྱ། །རྟག་ཏུ་དགེ་ཞིང་མཆོད་ལ་དགའ། །
en: He will be wise, highly esteemed, And wholeheartedly devoted to his teachers.

source: ལྷ་མོ་སྒྲོལ་མ་རྫུ་འཕྲུལ་ཆེ། །དེ་ཡི་སྔགས་ཀྱང་རབ་ཏུ་བསྒྲུབས། །
en: He will accomplish the mantra Of the powerful goddess Tārā. {53.525}

source: དེས་ཀྱང་སྔགས་ནི་རབ་བསྒྲུབས་པ། །ས་སྟེང་རྒྱལ་པོའི་ཆེད་དུའོ། །
en: “His mantra accomplishment will also [serve] The interests of his kingdom on earth.

source: ཕྱོགས་ཆེ་དཔུང་ནི་ཆེན་པོ་དང་། །རྒྱལ་པོ་གྲགས་པ་ཆེན་པོ་སྟེ། །
en: This king, with powerful vassals and a great army, Will be called ‘great lord’ on earth. {53.526}

source: གཉེན་དང་རིགས་དང་རྒྱལ་པོས་ཀྱང་། །དེ་ནི་བཀུར་བ་ཉིད་དུ་འགྱུར། །
en: “He will be accepted as king Even by his own relatives.

source: རྩ་བརྒྱད་སྟོང་གི་གཙུག་ལག་ཁང་། །དེ་ཡི་དུས་སུ་ཡོད་པར་འགྱུར། །
en: At that time, there will be Eight thousand monasteries [in his domain]. {53.527}

source: དེ་ཡི་སྔགས་ཀྱི་མཐུས་ཡིས་ནི། །ལོ་ནི་ཉིས་བརྒྱ་དག་ཏུ་འཚོ། །
en: “Through the power of his mantra He will live two hundred years.

source: གང་ཚེ་དེ་ལུས་ཞིག་པ་ན། །དགའ་ལྡན་དུ་ནི་སྐྱེ་བར་འགྱུར། །བྱང་ཆུབ་སེམས་དཔའ་རྫུ་འཕྲུལ་ཆེ། །ལྷ་ཡི་བུས་ཀྱང་བཀུར་བར་འགྱུར། །
en: When he leaves his body, He will be reborn in Tuṣita And revered by the gods there As a powerful bodhisattva. {53.528}

source: ཆོས་ཀྱི་བདག་ཉིད་དེ་མཐར་གྱིས། །བྱང་ཆུབ་ཡན་ལག་མངོན་རྫོགས་ནས། །
en: “In due course he will fully assimilate the Dharma By perfecting the limbs of awakening

source: འབད་པས་དེ་ནི་མཐར་གྱིས་ཀྱང་། །མཉམ་མེད་བྱང་ཆུབ་ཐོབ་པར་འགྱུར། །
en: And, with due effort and care, Will attain the unequaled awakening. {53.529}

source: དུས་ཀུན་དེ་ཡི་ཡུལ་དུ་ནི། །གསུང་རབ་མང་པོ་གནས་འགྱུར་བ། །སྔོན་གྱི་རྒྱལ་བ་དག་གིས་གསུངས། །ད་ལྟར་ངས་ཀྱང་གསུངས་པ་ཡིན། །
en: “In that country the teachings Will always proliferate, Whether those taught by the victors in the past Or those taught now by me.

source: རྫུ་འཕྲུལ་ཆེན་པོ་ཀླུ་དང་ནི། །འདོད་ཆགས་བྲལ་བས་རྣམ་པར་གནས། །
en: It will be filled with desireless beings And powerful nāga s. {53.530}

source: དེ་བཞིན་འཇིག་རྟེན་སྐྱོང་བ་དང་། །གནོད་སྦྱིན་བསྟན་པ་སྲུང་བྱེད་དང་། །ས་སྟེང་དམ་ཆོས་སྲུང་བྱེད་པ། །དེ་ཡི་ཚེ་ན་འབྱུང་བར་འགྱུར། །
en: “At that time, there will be on earth The guardian deities and the yakṣa s Who will guard the teachings of the Teacher And protect the sacred Dharma. {53.531}

source: དེ་ལྟར་རྣམ་པ་མང་པོ་བསྟན། །ས་བདག་འཇིག་རྟེན་རྣམ་གྲགས་པ། །
en: “Kings of many different types have been foretold Who will be renowned throughout the world.

source: བསྟན་དང་སྟོན་པར་འགྱུར་བ་ཡིན། །ནུབ་ཕྱོགས་ཡུལ་ནི་མཐའ་ཡས་པ། །འཕགས་རྒྱལ་ཞེས་བྱའི་ཕ་རོལ་ཏུ། །ལ་དའི་ཡུལ་གྱི་སྐྱེ་བོ་ནི། །
en: Having been taught themselves, They will teach [the Dharma] at that terrible time. {53.532} “In the country of the Lāḍas, Which extends from Ujjain To the westernmost part Bordered by the ocean, {53.533}

source: ངང་ཚུལ་ཞེས་བྱའི་རྒྱལ་པོ་ཡོད། །སངས་རྒྱས་རྣམས་ཀྱི་བསྟན་ལ་དད། །
en: “There will be a Dharma king By the name of Śīla, who will take delight In the teachings of the Buddha.

source: གྲོང་ཁྱེར་ཕྱིན་ནས་ཡང་དག་ཞུགས། །
en: He will be based in the city of Vallabhī. {53.534}

source: ཆོས་ཀྱི་རྒྱལ་པོར་འགྱུར་བ་སྟེ། །མཆོད་རྟེན་སྣ་ཚོགས་གཙུག་ལག་ཁང་། །དེ་བཞིན་སྲོག་ཆགས་དགེ་བར་ནི། །ས་བདག་ཆོས་ལ་མཉེས་གཤིན་པས། །རིག་པའི་བདག་ཉིད་བྱེད་པར་འགྱུར། །
en: “The king, fond of the Dharma, Will apply himself wholeheartedly To the task of building fine monasteries and reliquaries And to improving the lives of sentient beings. {53.535}

source: རྒྱལ་བའི་གཟུགས་བརྙན་ཡིད་འོང་ལ། །རྣམ་པ་སྣ་ཚོགས་མཆོད་པ་བྱེད། །
en: “He will perform various pūjās And make beautiful images of the Victorious One.

source: འཇིག་རྟེན་མགོན་པོ་གྲགས་ཆེན་གྱི། །མཆོད་རྟེན་མཆོག་ལའང་མཆོད་པ་བྱེད། །
en: He will worship the finest reliquaries Of the most illustrious among the lords of the world.

source: དེས་ན་དེ་ནི་སྔགས་ཀྱང་གྲུབ། །རྒྱལ་པོ་ལས་སྐྱེས་ཁོ་ན་ནི། །
en: He will not be a master of mantras But only reap the supreme benefits of his past karma. {53.536}

source: དེ་ཡི་ཡུལ་དུ་ཡང་དག་གྲགས། །དགེ་སློང་བསོད་སྙོམས་བྱེད་པ་ནི། །
en: In that country, there was once A well-known monk who subsisted on alms.

source: ཚུལ་ཁྲིམས་ལྡན་ཞིང་བློ་དང་ལྡན། །སངས་རྒྱས་རྣམས་ཀྱི་བསྟན་ལ་དད། །
en: He was disciplined, intelligent, And took delight in the teachings of the Buddha. {53.537}

source: བདག་ཉིད་ཆེན་པོ་དུས་སུ་རྒྱུ། །དེ་ནི་བསོད་སྙོམས་རབ་ཞུགས་རྒྱུ། །
en: “In the course of time, this great being Entered [the royal city] on an alms round.

source: རྒྱལ་པོའི་ཁབ་བཟང་རབ་མཐོང་བ། །རྒྱ་ཆེ་སྐྱེ་བོས་གང་བ་ལ། །
en: He beheld a splendid royal palace, Sprawling and bustling with people. {53.538}

source: བསླང་བའི་དོན་དུ་དེར་ཡང་ཞུགས། །བཀྲེས་པ་དང་ཡང་ཡང་དག་ལྡན། །ངལ་ཞིང་ལྟོགས་པའི་ཡིད་གྱུར་ཀྱང་། །དེ་ཚེ་བསོད་སྙོམས་རྙེད་མ་གྱུར། །
en: “Seeking alms, he entered there, Afflicted by hunger, thirsty, And weary in his mind. He did not obtain any alms. {53.539}

source: རྒྱལ་པོའི་སྐྱེས་བུས་དེ་མྱུར་བཟུང་། །ཁྱིམ་དེ་ལས་ནི་ཕྱུང་བར་འགྱུར། །
en: “He was seized by guardsmen, Swiftly expelled from the house,

source: དེ་ནས་དེ་ནི་ཡིད་བྱུང་ནས། །རྒྱལ་པོའི་མི་ལ་རབ་ཁྲོས་ཏེ། །
en: And escorted away by the king’s soldiers In a state of mental distress. {53.540}

source: གྲོང་ཁྱེར་དེ་ལས་ངེས་བྱུང་ནས། །མོད་ལ་དེ་ཡི་རང་གནས་ཕྱིན། །ལྟོགས་ཤིང་སྐོམ་པ་ཉིད་གྱུར་པས། །
en: “He then left that city And went to his own place, Hungry and thirsty.

source: སྡུག་བསྔལ་ཡིད་མི་བདེ་བར་གྱུར། །
en: In his pain, his mind grew dim. {53.541}

source: དེ་ནས་དེ་ནི་ཟས་ཆད་ནས། །མཚན་ཕྱེད་དུ་ནི་ལངས་གྱུར་ནས། །
en: “Deprived of nourishment, The ascetic breathed out his last At midnight.

source: སྡོམ་བརྩོན་དེ་ནི་སེམས་ཆུད་པས། །དེ་ཚེ་སྲོག་ནི་གཏང་བར་རྩོམ། །དེ་ཚེ་སྨོན་ལམ་བྱེད་པ་ནི། །ལ་དའི་ཡུལ་གྱི་བདག་པོར་ཤོག །
en: Quick in his mind, He made an aspiration at that time, To be reborn as the king of the Lāḍas. {53.542}

source: དེ་ནས་དགེ་སློང་དུས་ལས་འདས། །སྤུ་གྲི་ཞེས་བྱའི་རྒྱལ་རིགས་སུ། །བདག་ཉིད་ཆེན་པོ་དེ་སྐྱེས་གྱུར། །སྟོན་པའི་བསྟན་པ་མཆོད་པར་བྱེད། །
en: “After some time has passed, the monk will be reborn In the royal Dhara family [as King Śīla]. This great being will worship The teachings of the Teacher. {53.543}

source: ལོ་ནི་སུམ་ཅུ་དག་ཏུ་ཡང་། །རྒྱལ་སྲིད་གནོད་པ་མེད་པར་བྱས། །
en: “He will rule for thirty years, Making the kingdom trouble-free.

source: བརྐམ་ཆགས་རང་མིའི་སྦྱོར་བ་ཡིས། །མ་ཞུའི་ནད་ཀྱིས་བཏབ་པར་གྱུར། །
en: As the result of a plot by his greedy kinsmen, He will develop indigestion and fall unconscious. {53.544}

source: དེ་ཚེ་རྒྱལ་པོ་ལུས་ཞིག་ནས། །དུས་བྱས་ལྷ་ཡི་གནས་སོང་བ། །
en: “When his body fails and the king dies, He will be reborn in the god realm

source: བྱམས་པ་གང་དུ་བཞུགས་པ་ཡི། །དགའ་ལྡན་ལྷ་ཡི་གནས་མཆོག་ཏུ། །བདག་ཉིད་ཆེན་པོས་ཆོས་འཆད་པར། །
en: Where the gods are ‘supremely happy’ And where Maitreya resides. {53.545}

source: དེ་ཉིད་དུ་ནི་སྐྱེ་བར་འགྱུར། །འོད་ཆེན་བྱམས་པ་ཆེན་པོ་ལ། །བསྙེན་བཀུར་བྱེད་ཅིང་ཆོས་ཀྱང་ཉན། །
en: “He will be reborn where this great being Teaches the Dharma, And he will respectfully listen To the teachings of the splendorous Maitreya.

source: བདག་ཉིད་ཆེན་པོ་དེ་མཐར་གྱིས། །རྙེད་པར་དཀའ་བའི་བྱང་ཆུབ་ཐོབ། །
en: In due course, he will attain the awakening That is so difficult to obtain. {53.546}

source: ཚུལ་ཁྲིམས་ཞེས་བྱའི་རྒྱལ་པོའི་འོག །གཡོ་བ་ཞེས་བྱ་འབྱུང་བར་འགྱུར། །
en: “Within half a year Of King Śīla’s demise, There will be another one called Capala.

source: ལོ་ནི་ལྔ་བཅུ་རྩ་ལྔ་དང་། །དེ་བཞིན་ཟླ་བ་ལྔ་རུ་འཚོ། །དེ་སྲིད་རྒྱལ་སྲིད་དེས་བྱས་ནས། །མཚོན་ཆས་འཚོ་བས་རབ་བསད་པ། །
en: Having ruled for five months, He will be killed By armed mercenaries. {53.547}

source: བུད་མེད་བྱས་པའི་སྐྱོན་ཉིད་ཀྱིས། །དེ་ནི་མཚོན་ཆས་བསད་པར་འགྱུར། །
en: “He will fall, slain with a sword, Because of problems brought on by women.

source: དེ་ཡི་ནུ་བོ་བརྟན་ཞེས་བྱ། །བརྟན་པ་ཆོས་ནི་བརྟན་པར་འགྱུར། །
en: Then Dhruva, his junior, Will firmly establish himself. {53.548}

source: སྔོན་ནི་བཀྲེན་པ་ཞམ་རིང་གྱུར། །ཡུལ་ནི་ལ་དའི་བདག་པོར་གྱུར། །
en: “A naive and heartsick womanizer, He will become the king of the Lāḍas.

source: ལྷག་མ་རྒྱལ་པོ་ཐམས་ཅད་དང་། །སྐྱེ་དགུ་ཀུན་ཀྱང་ཞམ་རིང་པའོ། །
en: All the remaining [Lāḍa] kings, however, Were womanizers only prior [to becoming kings]. {53.549}

source: ཚུལ་ཁྲིམས་ཞེས་བྱ་རབ་འདས་ནས། །དེ་ནི་དེ་དག་ཀུན་གྱི་སྔར། །ས་བདག་ཐམས་ཅད་འབྱུང་འགྱུར་བ། །དཔའ་བོ་རྒྱ་མཚོའི་ཕ་རོལ་འགྲོ། །
en: “After King Śīla’s demise, The lines of these former [servants] Will all become kings Over the maritime provinces as far as Persia. {53.550}

source: རྒྱལ་པོ་དབང་པོ་ཟླ་མཛེས་དང་། །དེ་བཞིན་དུ་ནི་གཞུ་དང་ཏོག །མེ་ཏོག་གཞུ་དང་རྒྱལ་པོའི་བུ། །རེས་ལྡན་གྲོང་ལས་བྱུང་བ་ཡིན། །
en: “In the city of Vāravatī There will be the kings Foretold under the names of Indra, Sucandra , Dhanus, Ketu, and Puṣpa. {53.551}

source: དང་པོའི་དང་པོ་སྔ་མ་དག །བ་ལའི་གྲོང་དུ་འབྱུང་བ་ཡིན། །འོད་ཅེས་བྱ་བ་སྟོད་རྣམས་དང་། །དེ་བཞིན་ཁྱབ་འཇུག་ཅེས་བྱ་བ། །
en: “They will come to the city of Vallabhī And start their own line [of kings], Thousands of whom will have the name Prabha or Viṣṇu. {53.552}

source: རྒྱལ་པོ་མཐའ་ཡས་གསུངས་པ་ནི། །ཡ་ང་བ་ཡི་རིགས་སུ་འབྱུང་། །དེ་དག་ཕྱི་མའི་རྒྱལ་པོ་ནི། །ཁྱབ་འཇུག་ཅེས་ནི་བྱ་བ་འབྱུང་། །
en: “There will be countless kings Descending from Yadu. The last of them Will have the name Viṣṇu. {53.553}

source: གྲོང་དང་སྐྱེ་བོ་གཉེན་དང་བཅས། །དྲང་སྲོང་དམོད་པས་གནོད་གྱུར་པས། །བློ་ལྡན་རྒྱལ་པོ་མེད་པར་འགྱུར། །གྲོང་ཁྱེར་ཆུ་ཡིས་རབ་ཏུ་གང་། །
en: “Cursed by a ṛṣi, This wise king will meet his end Along with his relatives and fellow city dwellers, And his city will be submerged in water—

source: དེ་ཚེ་དེ་ཡི་རེས་ལྡན་གྲོང་། །རྒྱ་མཚོ་ཆེན་པོས་རབ་ཏུ་གང་། །
en: His Vāravatī will find Its resting place in the ocean. {53.554}

source: བྱང་གི་ཕྱོགས་ནི་ཐམས་ཅད་དུ། །རྩོམ་པ་སྣ་ཚོགས་རི་ཞོལ་བརྟན། །སྣ་ཚོགས་རིགས་ལ་གནས་པ་ཡི། །རྒྱལ་པོ་རྣམས་ནི་མཐའ་ཡས་གསུངས། །ཉི་ཤུ་གཅིག་དང་སུམ་ཅུ་ཡི། །མི་ཡི་རྒྱལ་པོར་ཤེས་པར་བྱ། །
en: “All around the northern area, In various foothill regions, There will rise, it is said, Countless kings of different origin, Thirty of them known to be Of the royal Śaka line. {53.555}

source: བཅྭ་བརྒྱད་ས་ཡི་བདག་པོ་ཞེས། །བར་མའི་ས་ཀུན་བདག་པོ་ཡིན། །
en: “Eighteen kings are foretold as rulers Of the entire middle country.

source: མཐའ་ཡས་ཀླུ་ཡི་སྡེ་ལ་སོགས། །དེ་ལས་ཐ་མ་རྣམ་པར་ཞིག །
en: In the end, those of the Nāgasena dynasty And the others will both come to an end. {53.556}

source: དེ་ནས་ཁྱབ་འཇུག་འཕྲོག་བྱེད་དང་། །མདུང་ཞེས་བྱ་བ་འཕྲོག་བྱེད་གཞན། །དབང་ལྡན་དང་ནི་ཕྲེང་ཀུན་དང་། །བཟའ་དང་བརྟུལ་ཞུགས་བཟང་པོ་གཞན། །དུས་ཀུན་ཆོས་ལུགས་རྣམ་པར་ཉམས། །
en: “After them will come Viṣṇu, Hara, Ājita [known] by the name of Kunta, Īśāna , Śarva, Paṅkti, Graha , and Suvrata. {53.557}

source: རྒྱལ་པོ་དེ་དག་དུས་ལས་འདས། །དེས་ནི་བྲམ་ཟེ་རིགས་བྱུང་བ། །དེ་ཚེ་ལོངས་སྤྱོད་ཆེ་ནོར་དང་། །བར་མཐར་ཡི་གེ་དང་པོ་བྷ། །དེ་ཚེ་བློན་པོ་གཉི་ག་གཙོ། །གཉི་ག་ནོར་ལྡན་དཔལ་ལྡན་གྲགས། །བསྟན་པ་ལ་ནི་ཕན་པར་དགའ། །
en: “When these kings fall Or otherwise lose importance, There will come two very wealthy and prosperous men Descended from [the king] Viṣṇu. {53.558} “They will be from Madhyadeśa, their names will start with Bh, And both will be chief ministers, Renowned as wealthy and prosperous, Who delight in this auspicious teaching. {53.559}

source: གཞོན་ནུ་ཁྱོད་ཀྱི་སྔགས་རྒྱལ་པོ། །བློན་པོས་དེ་ཚེ་སྔགས་ཀྱང་བཟླས། །དེ་ནས་བཟུང་ནས་ས་ཡི་བདག །གཉི་ག་མི་ཡི་དབང་ཕྱུག་གྱུར། །
en: “They will also recite mantras— One that is king among your mantras, O divine youth. Subsequently they will become [kings], Protectors of the land and lords of the people. {53.560}

source: བདུན་དང་བརྒྱད་དང་དེ་བཞིན་གསུམ། །དེ་ཚེ་དཔལ་མགྲིན་གནས་ན་འདུག །
en: “The population of Śrīkaṇṭha will be Seven times eight times three hundred.

source: སྟོན་པ་ཉི་མ་ཞེས་བྱ་བའི། །གནས་ན་དབང་ཕྱུག་རབ་ཏུ་གནས། །
en: The vaiśyas with the name of Āditya Will dwell in [the capital] Sthāṇvīśvara. {53.561}

source: ཐམས་ཅད་གནས་སུ་ས་ཡི་བདག །འབྱུང་བར་འགྱུར་བར་ཐེ་ཚོམ་མ་མེད། །
en: “In the end, there will undoubtedly come a king Who will rule over the entire territory.

source: ཡི་གེ་ཧ་ཞེས་རབ་གསུངས་པ། །ས་རྣམས་ཀུན་ལ་མི་ཡི་བདག །
en: His name will start with the letter H, And he will be, it is said, the king of all of the land. {53.562}

source: དེ་ཡི་ཡུལ་དུ་སྔགས་འདི་དག །དེ་ཚེ་གྲུབ་པར་འགྲོ་བ་ཡིན། །ཞི་དང་རྒྱས་པའི་རིག་པ་རྣམས། །གང་ཞིག་ཆོས་རྒྱལ་གྱིས་གསུངས་པ། །
en: “The mantras that will be efficacious In that country at that time Will be the vidyā s of pacifying and nourishing Taught by the Dharma King. {53.563}

source: ལོངས་སྤྱོད་རྣམ་པ་སྣ་ཚོགས་ཚོགས། །དེ་བཞིན་རྣམ་པ་སྣ་ཚོགས་ལྡན། །
en: “[As the result, people] will enjoy Various material comforts and good fortunes.

source: སྣ་ཚོགས་གཟུགས་ཀྱི་གཟུངས་དང་ནི། །རྫུ་འཕྲུལ་ཆེན་པོ་གནོད་སྦྱིན་མོ། །དེ་ཚེ་དུས་ཀྱི་ཐ་མ་ལ། །དེར་ནི་གྲུབ་པར་འགྱུར་བ་ཡིན། །
en: The powerful yakṣiṇīs Manifesting various forms Will be effectively mastered there During the debased eon. {53.564}

source: ལྷོ་ཡི་ཕྱོགས་ལ་ཡང་དག་བསྟན། །རྒྱ་མཚོའི་འགྲམ་གྱི་ས་དག་ལ། །རྒྱལ་པོ་དཀར་དང་ཟླ་མཛེས་དང་། །ས་ལ་ཡི་ནི་བཞོན་པ་དང་། །
en: “In the southern territories That border on the ocean Will rise King Svātisucandra Of the Sātavāhana dynasty. {53.565}

source: དབང་ཆེན་དང་ནི་བདེ་བྱེད་དང་། །ས་བདག་དེ་བཞིན་ཡིད་དུ་འོང་། །ལོངས་སྤྱོད་སྐྲ་བཟང་སྐྲ་ཞེས་སུ། །ལྷོ་ཡི་ཕྱོགས་སུ་རྣམ་པར་གྲགས། །
en: “There will be kings Mahendra, Śaṅkara, And the great Vallabha, Also called Sukeśin or Keśin, In the southern countries.

source: བཀྲ་ཤིས་དང་ནི་རྙེད་སླ་དང་། །བ་ལང་རྙེད་དང་ཁྱུ་ཉིད་དང་། །གྲུ་བཟང་དེ་བཞིན་གྲུ་དག་དང་། །དབང་ཆེན་དང་ནི་ཟླ་བ་ཉིད། །བ་ལང་སྲུང་དབང་ཟླ་བའི་སྡེ། །འདོད་ལྷ་དེ་བཞིན་མ་ག་དྷཱ། །
en: There will be Maṅgala called Vallabha, And also Govinda called Vṛṣaketu. {53.566} “The king Mahendra will also be called Mahāpota, Pota, and Candra. Gopendra will be also called Indrasena, And Mādhava, Pradyumna. {53.567}

source: གྲོང་བྱེད་བདེ་བྱེད་ཉིད་དང་ནི། །སྟག་དང་སེང་གེ་གཟའ་ལྷག་དང་། །
en: “Gaṇaśaṅkara will be called ‘Tiger,’ And Budha, ‘Lion.’

source: སངས་རྒྱས་དག་པ་བུམ་པ་དང་། །བུམ་པ་མ་ལུས་ཉིད་དུ་བརྗོད། །
en: The pure Budha will also be known By the names of Kumbha and Nikumbha. {53.568}

source: མཉམ་དང་ལེགས་པར་འཇམ་པ་དང་། །སྐྲ་བཟང་སྐྲ་ནི་ལྡན་པ་དང་། །ལྷོ་ཡི་ཕྱོགས་སུ་ས་ཡི་བདག །མཐའ་ཡས་མང་པོར་བསྟན་པ་ཡིན། །
en: “There will be Mathita, Sumita, Bala, and the keśin kings Pulina and Sukeśin. {53.569}

source: འདས་དང་མ་འོངས་པ་དག་དང་། །ད་ལྟར་དག་ཏུ་རྟོགས་པར་གྱིས། །
en: “There are innumerable kings Said to belong to the southern region— They include the past, The present, and the future kings. {53.570}

source: རྣམ་པ་སྣ་ཚོགས་ནད་བཏབ་ནས། །འདི་དག་རྣམ་པ་སྣ་ཚོགས་འཆི། །མཚོན་གྱིས་འདེབས་དང་མུ་གེ་ཡིས། །འཆི་ཞིང་ཁ་ཅིག་ཕྱོགས་གཞན་འགྲོ། །
en: “They will be afflicted by various diseases And will die different types of death, Including in armed conflicts or from famine. Some of them will go to heaven. {53.571}

source: དེ་ལྟར་འདི་དག་རྒྱལ་པོ་རྣམས། །ཀན་ཙི་པུ་རར་གནས་པར་བསྟན། །
en: “It is said that all these kings Will be given to hostilities.

source: དེ་བཞིན་སྟོང་ཕྲག་རྣམ་གྲགས་པ། །དེ་ཚེ་འབྱུང་བར་འགྱུར་བ་ཡིན། །
en: They will end with Mahendra called Pota, Meeting their destruction just like him. {53.572}

source: དེ་དུས་དེ་ཚེ་ཕྱོགས་དག་ཏུ། །སྔགས་རྣམས་གྲུབ་པར་འདོད་ན་ནི། །
en: “Those who so desire will be able To accomplish their mantras at that time and place.

source: ཁྲོ་བོ་རྡོ་རྗེའི་རིགས་བསྟན་པའི། །སྔགས་འདི་དག་ནི་བསྒྲུབ་པར་བྱ། །མངོན་པར་སྤྱོད་པའི་ལས་དག་དང་། །དེ་བཞིན་དབང་གི་དོན་ཡང་འགྲུབ། །
en: The mantras that can be accomplished Will be those of the Vajra family That are beneficial in the activities Of assault and of subduing. {53.573}

source: གཞོན་ནུ་བྱིས་པའི་གཟུགས་ཅན་ནི། །འཇམ་པའི་དབྱངས་ནི་བདག་ཉིད་ཆེ། །དེ་ཚེ་དུས་མཐར་ཕྱིན་པ་ན། །དེ་ཚེ་ཡུལ་དེར་འགྲུབ་པར་འགྱུར། །
en: “The mantra of the great being Mañjuśrī, The divine prince with a youthful form, Will be effective in that land, At that time, during the lowest eon. {53.574}

source: རི་བོ་འབིགས་བྱེད་ལ་བརྟེན་ནས། །རྒྱ་མཚོ་བ་ཚྭ་ཅན་འགྲམ་དུ། །གདོང་དྲུག་ཅེས་ནི་ཡང་དག་བསྒྲགས། །སེམས་ཅན་རྣམས་ལ་མཆོག་སྦྱིན་བྱེད། །
en: “The deity known as Kārttikeya Will grant boons to beings Who dwell between the Vindhyas And the saltwater oceans. {53.575}
